import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import './answer.dart';
import './start.dart';
import 'dart:math';

class questionpage extends StatefulWidget {
  @override
  _questionpageState createState() => _questionpageState();
}

class _questionpageState extends State<questionpage> {
  final questions = const [
//1.1
    {
      'questionText': 'Γιατί δημιουργήθηκε η Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text':'Για να τεθεί τέλος στους συχνούς πολέμους που κατέληξαν στον Β’ Παγκόσμιο Πόλεμο', 'score': 10},
        {'text':'Για να αντισταθούν οι Ευρωπαίοι στην οικονομική ανάπτυξη των Ηνωμένων Πολιτειών της Αμερικής', 'score': 0},
        {'text':'Για να ενωθούν οι δυτικές χώρες της Ευρώπης έναντι των χωρών του Συμφώνου της Βαρσοβίας', 'score': 0},
        {'text': 'Για να καταργηθούν τα σύνορα μεταξύ των χωρών της Ευρώπης', 'score': 0},
      ],
    },

//1.2
    {
      'questionText':
      'Ποιος ήταν ο πρόδρομος της δημιουργίας της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Η Κοινωνία των Εθνών', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Κοινότητα Άνθρακα και Χάλυβα', 'score': 10},
        {'text': 'Το Κίνημα των Αδεσμεύτων', 'score': 0},
        {'text': 'Η Κοινοπολιτεία των Εθνών', 'score': 0},
      ],
    },

//1.3
    {
      'questionText':
      'Πότε δημιουργήθηκε η Εοκ (Ευρωπαϊκή οικονομική κοινότητα);',
      'answers': [
        {'text': '9 Μαΐου 1950', 'score': 0},
        {'text': '18 Απριλίου 1951', 'score': 0},
        {'text': '30 Αυγούστου 1954', 'score': 0},
        {'text': '25 Μαρτίου 1957', 'score': 10},
      ],
    },

//1.4
    {
      'questionText':
      'Πότε υπέβαλαν η Ελλάδα και η Τουρκία αίτηση σύνδεσης με την Εοκ;',
      'answers': [
        {'text': '2004', 'score': 0},
        {'text': '1999', 'score': 0},
        {'text': '2012', 'score': 0},
        {'text': '1959', 'score': 10},
      ],
    },

//1.5
    {
      'questionText':
      'Ποιος από τους πιο κάτω δεν περιλαμβάνεται στους ιδρυτές της ΕΕ;',
      'answers': [
        {'text': 'Μιχαήλ Γκορμπατσώφ (Mikhail Gorbachev)', 'score': 10},
        {'text': 'Ουίνστον Τσόρτσιλ (Winston Churchill) ', 'score': 0},
        {'text': 'Ρομπέρ Σουμάν (Robert Schuman)', 'score': 0},
        {'text': 'Αλτιέρο Σπινέλι (Altiero Spinelli)', 'score': 0},
      ],
    },
//1.6
    {
      'questionText':
      'Ο Oυίνστον Tσόρτσιλ, ένας εκ των 11 ανθρώπων που θεωρούνται οι ιδρυτές της ΕΕ, διετέλεσε:',
      'answers': [
        {'text': 'Πρωθυπουργός του Ηνωμένου Βασιλείου', 'score': 10},
        {'text': 'Κυβερνήτης της Κύπρου', 'score': 0},
        {'text': 'Πρωθυπουργός της Πολωνίας', 'score': 0},
        {'text': 'Πρόεδρος των ΗΠΑ', 'score': 0},
      ],
    },

//1.7
    {
      'questionText':
      'Τι καταργήθηκε την 1η Ιουλίου 1968 μεταξύ των έξι, τότε, κρατών μελών της ΕΕ;',
      'answers': [
        {'text': 'Η ελεύθερη διασυνοριακή διακίνηση ανθρώπων', 'score': 0},
        {'text': 'Η απαγόρευση στη μεταφορά κατοικίδιων ζώων', 'score': 0},
        {'text': 'Οι τελωνειακοί δασμοί', 'score': 10},
        {'text': 'Η απαγόρευση πώλησης γαλλικής σαμπάνιας εκτός Γαλλίας','score': 0},
      ],
    },

//1.8
    {
      'questionText':
      'Ποια από τις πιο κάτω δεν περιλαμβάνεται στις «τέσσερις ελευθερίες» μεταξύ των κρατών μελών της ΕΕ που καθιερώθηκαν με την ολοκλήρωση της Ενιαίας Αγοράς το 1993;',
      'answers': [
        {'text': 'Ελεύθερη κυκλοφορία εφευρέσεων', 'score': 10},
        {'text': 'Ελεύθερη κυκλοφορία αγαθών', 'score': 0},
        {'text': 'Ελεύθερη κυκλοφορία προσώπων', 'score': 0},
        {'text': 'Ελεύθερη κυκλοφορία υπηρεσιών', 'score': 0},
      ],
    },

//1.9
    {
      'questionText':
      'Με ποια συνθήκη η «Ευρωπαϊκή κοινότητα» μετονομάστηκε, στις 7 Φεβρουαρίου 1992, επίσημα, σε «Ευρωπαϊκή Ένωση»;',
      'answers': [
        {'text': 'Συνθήκη της Λευκωσίας', 'score': 0},
        {'text': 'Συνθήκη των Ευρωπαίων', 'score': 0},
        {'text': 'Συνθήκη του Μάαστριχτ', 'score': 10},
        {'text': 'Συνθήκη των Σεβρών', 'score': 0},
      ],
    },

//1.10
    {
      'questionText':
      'Η συμφωνία του Σένγκεν, που τέθηκε σε εφαρμογή στις 26 Μαρτίου 1995, σε επτά χώρες προνοούσε ότι οι υπήκοοί τους μπορούσαν: ',
      'answers': [
        {'text': 'Να αγωνίζονται σε ποδοσφαιρικές ομάδες όποιας χώρας ήθελαν','score': 0},
        {'text': 'Να επιλέξουν την υπηκοότητα που προτιμούσαν', 'score': 0},
        {'text': 'Να διακινούνται χωρίς έλεγχο διαβατηρίων στα σύνορα','score': 10},
        {'text':'Να επιλέγουν τη χώρα στην οποία θα πληρώνουν φόρο εισοδήματος','score': 0},
      ],
    },


//2.1
    {
      'questionText': 'Ποιο από τα πιο κάτω δεν περιλαμβάνεται στα τέσσερα βασικά θεσμικά όργανα της ΕΕ;',
      'answers': [
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Η Ευρωπαϊκή Επιτροπή', 'score': 0},
        {'text': 'Η UNESCO', 'score': 10},
        {'text': 'Το Συμβούλιο της Ευρωπαϊκής Ένωσης', 'score': 0},
      ],
    },

//2.2
    {
      'questionText': 'Το Ευρωπαϊκό Συμβούλιο, ένα από τέσσερα βασικά θεσμικά όργανα της ΕΕ, όπου συνεδριάζουν οι ηγέτες σε εθνικό και ευρωπαϊκό επίπεδο, θέτει:',
      'answers': [
        {'text': 'Τις γενικές προτεραιότητες της ΕΕ', 'score': 10},
        {'text': 'Τους κανόνες δεοντολογίας της ΕΕ', 'score': 0},
        {'text': 'Όρους για τις εξαγωγές προϊόντων των χωρών μελών στην Ασία', 'score': 0},
        {'text': 'Όρια στις ελευθερίες των πολιτών της ΕΕ', 'score': 0},
      ],
    },

//2.3
    {
      'questionText': 'Στο Ευρωπαϊκό κοινοβούλιο οι άμεσα εκλεγμένοι ευρωβουλευτές εκπροσωπούν:',
      'answers': [
        {'text': 'Τους Ευρωπαίους πολίτες', 'score': 10},
        {'text': 'Τα κόμματά τους', 'score': 0},
        {'text': 'Τις κυβερνήσεις των χωρών τους', 'score': 0},
        {'text': 'Τους εαυτούς τους', 'score': 0},
      ],
    },

//2.4
    {
      'questionText': 'Η Ευρωπαϊκή Επιτροπή, της οποίας τα μέλη διορίζονται από τις εθνικές κυβερνήσεις, προωθεί:',
      'answers': [
        {'text': 'Τα συμφέροντα κάθε κράτους μέλους', 'score': 0},
        {'text': 'Τα συμφέροντα του κράτους μέλους που προεδρεύει κάθε φορά', 'score': 0},
        {'text': 'Τις θέσεις των πέντε πλουσιότερων χωρών της ΕΕ', 'score': 0},
        {'text': 'Τα συμφέροντα της ΕΕ ως συνόλου', 'score': 10},
      ],
    },

//2.5
    {
      'questionText': 'Στο Συμβούλιο της Ευρωπαϊκής Ένωσης οι κυβερνήσεις:',
      'answers': [
        {'text': 'Ψηφίζουν τους βουλευτές για το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Προασπίζουν τα εθνικά συμφέροντα των χωρών τους', 'score': 10},
        {'text': 'Δίνουν συμβουλές στις άλλες χώρες για διάφορους τομείς', 'score': 0},
        {'text': 'Ρυθμίζουν τις εισαγωγές προϊόντων από τρίτες χώρες', 'score': 0},
      ],
    },

//2.6
    {
      'questionText': 'Το Ευρωπαϊκό Συμβούλιο έχει:',
      'answers': [
        {'text': 'Δικαστική εξουσία', 'score': 0},
        {'text': 'Νομοθετική εξουσία', 'score': 0},
        {'text': 'Εκτελεστική εξουσία', 'score': 0},
        {'text': 'Την εξουσία να καθορίσει τις γενικές πολιτικές κατευθύνσεις της ΕΕ', 'score': 10},
      ],
    },

//2.7
    {
      'questionText': 'Το Ευρωπαϊκό Συμβούλιο, με επικεφαλής τον πρόεδρό του και αποτελούμενο από τους αρχηγούς των κρατών μελών και τον πρόεδρο της Επιτροπής, συνεδριάζει:',
      'answers': [
        {'text': 'Κάθε εβδομάδα', 'score': 0},
        {'text': 'Στη Νέα Υόρκη', 'score': 0},
        {'text': 'Τουλάχιστον κάθε 6 μήνες', 'score': 10},
        {'text': 'Κάθε 5 χρόνια', 'score': 0},
      ],
    },

//2.8
    {
      'questionText': 'Οι συσκέψεις του Ευρωπαϊκού Συμβουλίου είναι στην ουσία:',
      'answers': [
        {'text': 'Σύνοδοι κορυφής', 'score': 10},
        {'text': 'Σύντομες', 'score': 0},
        {'text': 'Ανεπίσημες', 'score': 0},
        {'text': 'Ασήμαντες', 'score': 0},
      ],
    },

//2.9
    {
      'questionText': 'Στο Ευρωπαϊκό Συμβούλιο μετέχει επίσης η/ο:',
      'answers': [
        {'text': 'Πρέσβης των Ηνωμένων Πολιτειών Aμερικής στην ΕΕ', 'score': 0},
        {'text': 'Εκπρόσωπος της Ένωσης για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας', 'score': 10},
        {'text': 'Εκπρόσωπος του Oργανισμού Bορειοατλαντικού Συμφώνου (ΝΑΤΟ)', 'score': 0},
        {'text': 'Γενικός Γραμματέας του Oργανισμού Hνωμένων Eθνών (ΟΗΕ)', 'score': 0},
      ],
    },

//2.10
    {
      'questionText': 'Οι σύνοδοι του Ευρωπαϊκού Συμβουλίου πραγματοποιούνται συνήθως:',
      'answers': [
        {'text': 'Σε χώρα εκτός της ΕΕ', 'score': 0},
        {'text': 'Πρωί', 'score': 0},
        {'text': 'Στις Βρυξέλλες', 'score': 10},
        {'text': 'Σαββατοκύριακο', 'score': 0},
      ],
    },


//3.1
    {
      'questionText': 'Πότε θα πραγματοποιηθούν οι επόμενες ευρωεκλογές;',
      'answers': [
        {'text': '2022', 'score': 0},
        {'text': '2024', 'score': 10},
        {'text': '2020', 'score': 0},
        {'text': '2021', 'score': 0},
      ],
    },

//3.2
    {
      'questionText': ' Με πόσους βουλευτές εκπροσωπείται η Κύπρος στο Ευρωπαϊκό κοινοβούλιο;',
      'answers': [
        {'text': 'Δύο', 'score': 0},
        {'text': 'Έξι', 'score': 10},
        {'text': 'Οκτώ', 'score': 0},
        {'text': 'Δεκαέξι', 'score': 0},
      ],
    },

//3.3
    {
      'questionText': 'Πρόεδρος του Ευρωπαϊκού κοινοβουλίου είναι ο/η:',
      'answers': [
        {'text': 'Ζαν-Κλοντ Γιούνκερ (Jean-Claude Juncker)', 'score': 0},
        {'text': 'Φεντερίκα Μογκερίνι (Federica Mogherini)', 'score': 0},
        {'text': 'Νταβίντ - Μαρία Σασσόλι (David - Maria Sassoli)', 'score': 10},
        {'text': 'Ντόναλντ Τουσκ (Donald Tusk)', 'score': 0},
      ],
    },

//3.4
    {
      'questionText': 'Ποια από τις πιο κάτω πόλεις δεν αποτελεί έδρα εργασιών του Ευρωπαϊκού κοινοβουλίου;',
      'answers': [
        {'text': 'Λουξεμβούργο', 'score': 0},
        {'text': 'Βρυξέλλες', 'score': 0},
        {'text': 'Βρυξέλλες', 'score': 0},
        {'text': 'Αμβούργο', 'score': 10},
      ],
    },

//3.5
    {
      'questionText': 'Πόσους βουλευτές διαθέτει το Ευρωπαϊκό κοινοβούλιο;',
      'answers': [
        {'text': 'Κάτω από 500', 'score': 0},
        {'text': 'Λιγότερους από 600', 'score': 0},
        {'text': 'Περισσότερους από 700', 'score': 10},
        {'text': 'Περισσότερους από 1000', 'score': 0},
      ],
    },

//3.6
    {
      'questionText': ' Τον Ευρωπαϊκό Προϋπολογισμό εγκρίνει:',
      'answers': [
        {'text': 'Η Ευρωπαϊκή Επιτροπή και το Συμβούλιο της ΕΕ', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Συμβούλιο', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο και η Ευρωπαϊκή Επιτροπή', 'score': 0},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο και το Συμβούλιο της ΕΕ', 'score': 10},
      ],
    },

//3.7
    {
      'questionText': 'Οι πρώτες εκλογές για την άμεση ανάδειξη των μελών του Ευρωπαϊκού κοινοβουλίου έγιναν το:',
      'answers': [
        {'text': '1950', 'score': 0},
        {'text': '1967', 'score': 0},
        {'text': '1979', 'score': 10},
        {'text': '1980', 'score': 0},
      ],
    },

//3.8
    {
      'questionText': 'Το Ευρωπαϊκό κοινοβούλιο (Εκ) διορίζει τον:',
      'answers': [
        {'text': 'Ευρωπαίο Διαμεσολαβητή', 'score': 10},
        {'text': 'Πρόεδρο της Γαλλίας', 'score': 0},
        {'text': 'Πρόεδρο του Συμβουλίου της ΕΕ', 'score': 0},
        {'text': 'Ύπατο Εκπρόσωπο για την Εξωτερική Πολιτική και Πολιτικής Ασφαλείας', 'score': 0},
      ],
    },

//3.9
    {
      'questionText': 'Ποιο από τα πιο κάτω δεν αποτελεί αρμοδιότητα του Εκ;',
      'answers': [
        {'text': 'Ψήφιση νόμων', 'score': 0},
        {'text': 'Έγκριση του προϋπολογισμού της ΕΕ', 'score': 0},
        {'text': 'Εκδίκαση ποινικών υποθέσεων που καθυστερούν στα κράτη μέλη', 'score': 10},
        {'text': 'Άσκηση ελέγχου πάνω στη δράση της Ευρωπαϊκής Επιτροπής  και του Ευρωπαϊκού Συμβουλίου', 'score': 0},
      ],
    },

//3.10
    {
      'questionText': 'Τα έγγραφα του κοινοβουλίου δημοσιεύονται:',
      'answers': [
        {'text': 'Μόνο στα αγγλικά', 'score': 0},
        {'text': 'Στα αγγλικά και τα γαλλικά', 'score': 0},
        {'text': 'Στα αγγλικά, τα γαλλικά και τα γερμανικά', 'score': 0},
        {'text': 'Σε όλες τις επίσημες γλώσσες της ΕΕ', 'score': 10},
      ],
    },


//4.1
    {
      'questionText': 'Την 1η Οκτωβρίου 2019, από πόσα κράτη μέλη αποτελείτο η Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': '15', 'score': 0},
        {'text': '25', 'score': 0},
        {'text': '28', 'score': 10},
        {'text': '30', 'score': 0},
      ],
    },

//4.2
    {
      'questionText': 'Πως λέγεται το χρηματοδοτικό πρόγραμμα της Ευρωπαϊκής Ένωσης που στηρίζει τον πολιτισμό;',
      'answers': [
        {'text': 'Δημιουργική Ευρώπη', 'score': 10},
        {'text': 'Πολιτιστική Ευρώπη', 'score': 0},
        {'text': 'Διασυνοριακή Ευρώπη', 'score': 0},
        {'text': 'Ευρώπη της κουλτούρας', 'score': 0},
      ],
    },

//4.3
    {
      'questionText': 'Ποια από τις πιο κάτω δεν είναι υποψήφια προς ένταξη στην Ευρωπαϊκή Ένωση χώρα;',
      'answers': [
        {'text': 'Ιρλανδία', 'score': 10},
        {'text': 'Μαυροβούνιο', 'score': 0},
        {'text': 'Σερβία', 'score': 0},
        {'text': 'Τουρκία', 'score': 0},
      ],
    },

//4.4
    {
      'questionText': 'Ποιο από τα πιο κάτω κράτη της ευρωπαϊκής ηπείρου δεν ανήκει στην Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': 'Εσθονία', 'score': 0},
        {'text': 'Λετονία', 'score': 0},
        {'text': 'Ελβετία', 'score': 10},
        {'text': 'Ουγγαρία', 'score': 0},
      ],
    },

//4.5
    {
      'questionText': 'Ποια από τις πιο κάτω είναι εν δυνάμει υποψήφια προς ένταξη στην Ευρωπαϊκή Ένωση χώρα;',
      'answers': [
        {'text': 'Λιθουανία', 'score': 0},
        {'text': 'Βοσνία - Ερζεγοβίνη', 'score': 10},
        {'text': 'Λετονία', 'score': 0},
        {'text': 'Κροατία', 'score': 0},
      ],
    },

//4.6
    {
      'questionText': 'Ποιο κράτος προσχώρησε στην Ευρωπαϊκή Ένωση την 1η Ιουλίου 2013;',
      'answers': [
        {'text': 'Ρουμανία', 'score': 0},
        {'text': 'Κροατία', 'score': 10},
        {'text': 'Νορβηγία', 'score': 0},
        {'text': 'Δανία', 'score': 0},
      ],
    },

//4.7
    {
      'questionText': 'Με πόσα ακόμη κράτη της ευρωπαϊκής ηπείρου συνορεύει η Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': '6', 'score': 0},
        {'text': '10', 'score': 0},
        {'text': '12', 'score': 0},
        {'text': '18', 'score': 10},
      ],
    },

//4.8
    {
      'questionText': 'Ποιο είναι το μικρότερο πληθυσμιακά κράτος μέλος της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Κύπρος', 'score': 0},
        {'text': 'Μάλτα', 'score': 10},
        {'text': 'Πολωνία', 'score': 0},
        {'text': 'Λουξεμβούργο', 'score': 0},
      ],
    },

//4.9
    {
      'questionText': 'Ποια κριτήρια πρέπει να πληροί ένα κράτος για να προσχωρήσει στην Ευρωπαϊκή Ένωση;',
      'answers': [
        {'text': 'Μάαστριχτ', 'score': 0},
        {'text': 'Σένγκεν', 'score': 0},
        {'text': 'Λισαβόνας', 'score': 0},
        {'text': 'Κοπεγχάγης', 'score': 10},
      ],
    },

//4.10
    {
      'questionText': 'Δεν είναι ιδρυτικό μέλος της Ευρωπαϊκής Ένωσης:',
      'answers': [
        {'text': 'Το Βέλγιο', 'score': 0},
        {'text': 'Το Λουξεμβούργο', 'score': 0},
        {'text': 'Η Ισπανία', 'score': 10},
        {'text': 'Οι Κάτω Χώρες', 'score': 0},
      ],
    },


//5.1
    {
      'questionText':
      'Προτεραιότητα της κυπριακής Προεδρίας στον τομέα της νεολαίας ήταν:',
      'answers': [
        {'text': 'Η συμμετοχή και κοινωνική ενσωμάτωση των νέων', 'score': 10},
        {'text': 'Ο εθελοντισμός', 'score': 0},
        {'text': 'Η καινοτομία', 'score': 0},
        {'text': 'Η εξασφάλιση περισσότερων θέσεων εργασίας', 'score': 0},
      ],
    },
//5.2
    {
      'questionText': 'Ποια ήταν η «Ευρωπαϊκή Πρωτεύουσα Νεολαίας» το 2019;',
      'answers': [
        {'text': 'Το Νόβι Σάντ', 'score': 10},
        {'text': 'Η Μπράγκα', 'score': 0},
        {'text': 'Η Θεσσαλονίκη', 'score': 0},
        {'text': 'Το Παλέρμο', 'score': 0},
      ],
    },

//5.3
    {
      'questionText': 'Το Ευρωπαϊκό κοινοβούλιο Νέων καθιερώθηκε:',
      'answers': [
        {'text': 'Το 1992', 'score': 0},
        {'text': 'Το 2000', 'score': 0},
        {'text': 'Το 1982', 'score': 0},
        {'text': 'Το 1987', 'score': 10},
      ],
    },

//5.4
    {
      'questionText':
      'Σε ποιες προσωπικότητες απονεμήθηκε, το 2016, το Βραβείο Ζαχάρωφ του Ευρωπαϊκού κοινοβουλίου για την ελευθερίας της σκέψης;',
      'answers': [
        {
          'text':
          'Στη Μαλάλα Γιουσαφζάι (Malala Yousafzai) και την Αλίν Μουκόβι Νίιμα (Aline Mukovi Neema)',
          'score': 0
        },
        {
          'text': 'Στον Στινγκ (Sting) και τον Τζάστιν Τρυντό (Justin Trudeau)',
          'score': 0
        },
        {
          'text':
          'Στη Νάντια Μουράντ Μπασί Ταχά (Nadia Murad Basee Taha) και την Λαμίγια Ατζί Μπασάρ (Lamiya Aji Bashar)',
          'score': 10
        },
        {
          'text':
          'Στον Χουάν Μανουέλ Σάντος (Juan Manuel Santos) και τον Μπομπ Ντύλαν (Bob Dylan)',
          'score': 0
        },
      ],
    },

//5.5
    {
      'questionText': 'Το βραβείο Lux καθιερώθηκε το 2007 και έχει στόχο:',
      'answers': [
        {
          'text': 'Το βραβείο Lux καθιερώθηκε το 2007 και έχει στόχο:',
          'score': 0
        },
        {
          'text':
          'Τη βράβευση μαθητών που ασχολούνται με ευρωπαϊκά προγράμματα',
          'score': 0
        },
        {
          'text':
          'Τη βράβευση δημοσιογράφων που ασχολούνται ενεργά με θέματα του Ευρωπαϊκού Κοινοβουλίου',
          'score': 0
        },
        {
          'text':
          'Τη βράβευση ευρωπαϊκών ταινιών οι οποίες προωθούν τις ευρωπαϊκές αξίες',
          'score': 10
        },
      ],
    },

//5.6
    {
      'questionText': 'Στόχοι της πρωτοβουλίας «Νεολαία σε κίνηση» είναι:',
      'answers': [
        {'text': 'Η εκπαίδευση και απασχόληση των νέων', 'score': 10},
        {'text': 'Η υγιής ψυχαγωγία', 'score': 0},
        {'text': 'Η εθελοντική εργασία', 'score': 0},
        {'text': 'Η προάσπιση των δικαιωμάτων των νέων', 'score': 0},
      ],
    },
//5.7
    {
      'questionText':
      '«Διπλή καριέρα-Dualcareers» στον Αθλητισμό σημαίνει ότι οι αθλητές:',
      'answers': [
        {
          'text':
          'Υψηλών επιδόσεων έχουν τη δυνατότητα να σπουδάζουν παράλληλα με τις προπονήσεις τους',
          'score': 10
        },
        {'text': 'Ασχολούνται με δύο επαγγέλματα', 'score': 0},
        {
          'text':
          'Αποφασίζουν αν θα ασχοληθούν με δύο πανεπιστημιακές κατευθύνσεις',
          'score': 0
        },
        {'text': 'Δεν γνωρίζουν τί ακριβώς θα ακολουθήσουν', 'score': 0},
      ],
    },

//5.8
    {
      'questionText':
      'Οι δράσεις για την πρωτοβουλία «Νεολαία σε κίνηση» άρχισαν να τίθενται σε εφαρμογή:',
      'answers': [
        {'text': 'Το 2012', 'score': 0},
        {'text': 'Το 2010', 'score': 10},
        {'text': 'Το 2001', 'score': 0},
        {'text': 'Το 2000', 'score': 0},
      ],
    },

//5.9
    {
      'questionText':
      'Ως πολίτης της ΕΕ, έχετε το δικαίωμα να κάνετε πανεπιστημιακές σπουδές σε οποιαδήποτε χώρα της ΕΕ.',
      'answers': [
        {'text': 'Ναι', 'score': 10},
        {'text': 'Όχι', 'score': 0},
        {'text': 'Εναπόκειται στην πολιτική του κάθε κράτους μέλους','score': 0},
        {'text': 'Ναι, αλλά θα καταβάλλετε υψηλότερα δίδακτρα', 'score': 0},
      ],
    },

//5.10
    {
      'questionText':
      'Υπάρχει αυτόματη αναγνώριση των τίτλων σπουδών σε όλη την Ευρώπη;',
      'answers': [
        {'text': 'Ναι', 'score': 0},
        {
          'text':
          'Κάθε χώρα εφαρμόζει τους δικούς της κανόνες για την αναγνώριση πτυχίων',
          'score': 10
        },
        {'text': 'Θα ισχύει η αυτόματη αναγνώριση από το 2020', 'score': 0},
        {
          'text': 'Μόνο εάν ο κάτοχος του πτυχίου εγκατασταθεί μόνιμα στη χώρα',
          'score': 0
        },
      ],
    },


//6.1
    {
      'questionText': 'Πότε αποφασίστηκε για πρώτη φορά στη διάσκεψη αρχηγών κρατών και κυβερνήσεων της Ευρώπης ότι ήταν αναγκαία μια κοινοτική πολιτική περιβάλλοντος;',
      'answers': [
        {'text': 'Το 1972', 'score': 10},
        {'text': 'Το 1952', 'score': 0},
        {'text': 'Το 1962', 'score': 0},
        {'text': 'Το 1982', 'score': 0},
      ],
    },

//6.2
    {
      'questionText': 'Πόσες νομοθετικές αποφάσεις έχει εγκρίνει η κοινότητα για περιορισμό της ρύπανσης;',
      'answers': [
        {'text': '26', 'score': 0},
        {'text': '250', 'score': 10},
        {'text': '2.500', 'score': 0},
        {'text': '25.000', 'score': 0},
      ],
    },

//6.3
    {
      'questionText': 'Η κοινοτική περιβαλλοντική πολιτική βασίζεται στις αρχές της προφύλαξης, της πρόληψης, της αποκατάστασης της ρύπανσης στην πηγή και:',
      'answers': [
        {'text': 'στην αρχή «ο ρυπαίνων πληρώνει»', 'score': 10},
        {'text': 'στην αρχή της ισότητας', 'score': 0},
        {'text': 'στην αρχή «ο ρυπαίνων φταίει»', 'score': 0},
        {'text': 'στην αρχή της αναλογικότητας', 'score': 0},
      ],
    },

//6.4
    {
      'questionText': 'Ποια συνθήκη ενίσχυσε τη σημασία της περιβαλλοντικής πολιτικής της Ευρωπαϊκής Ένωσης;',
      'answers': [
        {'text': 'Η Συνθήκη του Μάαστριχτ', 'score': 0},
        {'text': 'Η Συνθήκη του Άμστερνταμ', 'score': 10},
        {'text': 'Η Συνθήκη της Λισαβόνας', 'score': 0},
        {'text': 'Η Συνθήκη των Βρυξελλών', 'score': 0},
      ],
    },

//6.5
    {
      'questionText': 'Πόση μείωση CO2 μπορεί να επιφέρει η ανακύκλωση 1 kg πλαστικού, σε σύγκριση με την κατασκευή νέων συσκευασιών;',
      'answers': [
        {'text': '150 kg', 'score': 0},
        {'text': '15 kg', 'score': 0},
        {'text': '500 kg', 'score': 0},
        {'text': '1,5 kg', 'score': 10},
      ],
    },

//6.6
    {
      'questionText': 'Ποια χρονολογία όρισε η ΕΕ για απαγόρευση των πλαστικών μιας χρήσης;',
      'answers': [
        {'text': '2021', 'score': 10},
        {'text': '2023', 'score': 0},
        {'text': '2024', 'score': 0},
        {'text': '2026', 'score': 0},
      ],
    },

//6.7
    {
      'questionText': 'Ποιο από τα παρακάτω δεν θεωρείται πλαστικό μιας χρήσης;',
      'answers': [
        {'text': 'Πλαστικά μαχαιροπήρουνα', 'score': 0},
        {'text': 'Πλαστικά καλαμάκια', 'score': 0},
        {'text': 'Επαναχρησιμοποιούμενα δοχεία φαγητού', 'score': 10},
        {'text': 'Μπατονέτες', 'score': 0},
      ],
    },

//6.8
    {
      'questionText': 'Ένα στα πόσα παιδιά στη ΕΕ πάσχουν από άσθμα;',
      'answers': [
        {'text': '7', 'score': 10},
        {'text': '17', 'score': 0},
        {'text': '27', 'score': 0},
        {'text': '37', 'score': 0},
      ],
    },

//6.9
    {
      'questionText': 'Η στρατηγική της ΕΕ για την αειφόρο ανάπτυξη ζητεί η οικονομική, περιβαλλοντική και ποια άλλη πολιτική να συμπληρώνουν η μια την άλλη;',
      'answers': [
        {'text': 'Επιχειρηματική', 'score': 0},
        {'text': 'Ιατροφαρμακευτική', 'score': 0},
        {'text': 'Αγροτική', 'score': 0},
        {'text': 'Κοινωνική', 'score': 10},
      ],
    },

//6.10
    {
      'questionText': 'Κατά ποιο ποσοστό δεσμεύτηκαν τα κράτη μέλη της ΕΕ, να μειώσουν τις εκπομπές αερίων του θερμοκηπίου κατά την περίοδο 2008-2012, κάτω από τα επίπεδα του 1990;',
      'answers': [
        {'text': '0,8%', 'score': 0},
        {'text': '8%', 'score': 10},
        {'text': '18%', 'score': 0},
        {'text': '180%', 'score': 0},
      ],
    },


//7.1
    {
      'questionText': 'Πόσα από τα κράτη μέλη της ΕΕ έχουν ως νόμισμά τους το ευρώ;',
      'answers': [
        {'text': '14', 'score': 0},
        {'text': '18', 'score': 0},
        {'text': '12', 'score': 0},
        {'text': '19', 'score': 10},
      ],
    },

//7.2
    {
      'questionText': 'Ποια Αρχή είναι υπεύθυνη για τη διαχείριση των νομισματικών ζητημάτων στην ΕΕ;',
      'answers': [
        {'text': 'Η Ευρωπαϊκή Κεντρική Τράπεζα', 'score': 10},
        {'text': 'Η Κομισιόν', 'score': 0},
        {'text': 'Η Τρόικα', 'score': 0},
        {'text': 'Το Διεθνές Νομισματικό Ταμείο', 'score': 0},
      ],
    },

//7.3
    {
      'questionText': 'Σε ποια πόλη λήφθηκε η απόφαση για τη δημιουργία μιας οικονομικής και νομισματικής ένωσης;',
      'answers': [
        {'text': 'Βερολίνο', 'score': 0},
        {'text': 'Μάαστριχτ', 'score': 10},
        {'text': 'Παρίσι', 'score': 0},
        {'text': 'Κοπεγχάγη', 'score': 0},
      ],
    },

//7.4
    {
      'questionText': 'Για ποιο από τα πιο κάτω ποσά δεν υπάρχει χαρτονόμισμα του ευρώ;',
      'answers': [
        {'text': '20 ευρώ', 'score': 0},
        {'text': '100 ευρώ', 'score': 0},
        {'text': '250 ευρώ', 'score': 10},
        {'text': '500 ευρώ', 'score': 0},
      ],
    },

//7.5
    {
      'questionText': 'Σε ποιο κυπριακό κέρμα του ευρώ απεικονίζεται το καράβι της Κερύνειας;',
      'answers': [
        {'text': 'Των 2 σεντ', 'score': 0},
        {'text': 'Των 5 σεντ', 'score': 0},
        {'text': 'Των 10 σεντ', 'score': 10},
        {'text': 'Των 2 ευρώ', 'score': 0},
      ],
    },

//7.6
    {
      'questionText': 'Σε πόσα σεντ υποδιαιρείτο η κυπριακή λίρα που αντικαταστάθηκε από το ευρώ;',
      'answers': [
        {'text': '1000', 'score': 0},
        {'text': '100', 'score': 10},
        {'text': '200', 'score': 0},
        {'text': '500', 'score': 0},
      ],
    },

//7.7
    {
      'questionText': 'Το χαρτονόμισμα της μίας κυπριακής λίρας ήταν χρώματος:',
      'answers': [
        {'text': 'Γαλάζιου', 'score': 0},
        {'text': 'Πράσινου', 'score': 0},
        {'text': 'Μπορντό', 'score': 0},
        {'text': 'Καφέ', 'score': 10},
      ],
    },

//7.8
    {
      'questionText': 'Πότε κυκλοφόρησαν τα χαρτονομίσματα και τα κέρματα του ευρώ;',
      'answers': [
        {'text': '1999', 'score': 0},
        {'text': '2000', 'score': 0},
        {'text': '2002', 'score': 10},
        {'text': '2004', 'score': 0},
      ],
    },

//7.9
    {
      'questionText': 'Ποια ήταν η τελευταία χώρα που εντάχθηκε στη ζώνη του ευρώ;',
      'answers': [
        {'text': 'Κύπρος', 'score': 0},
        {'text': 'Σλοβακία', 'score': 0},
        {'text': 'Σλοβενία', 'score': 0},
        {'text': 'Λιθουανία', 'score': 10},
      ],
    },

//7.10
    {
      'questionText': 'Ποιο ήταν το νόμισμα της Γερμανίας πριν από το ευρώ;',
      'answers': [
        {'text': 'Μάρκο', 'score': 10},
        {'text': 'Λίρα', 'score': 0},
        {'text': 'Φράγκο', 'score': 0},
        {'text': 'Κορόνα', 'score': 0},
      ],
    },


//8.1
    {
      'questionText': 'Σύμφωνα με τη συνθήκη του Μάαστριχτ, κάθε πολίτης της Ένωσης, ανεξαρτήτως εθνικότητας, έχει το δικαίωμα:',
      'answers': [
        {'text': 'Να ψηφίζει και να είναι υποψήφιος στη χώρα της ΕΕ στην οποία ζει ', 'score': 10},
        {'text': 'Προστασίας των προσωπικών του δεδομένων', 'score': 0},
        {'text': 'Δίκαιης δίκης, πολιτικής ή ποινικής', 'score': 0},
        {'text': 'Ελευθερίας της έκφρασης', 'score': 0},
      ],
    },

//8.2
    {
      'questionText': 'Τα δικαιώματα των πολιτών της ΕΕ προστατεύονται από:',
      'answers': [
        {'text': 'Την αρμόδια αρχή κάθε χώρας', 'score': 0},
        {'text': 'Τον Χάρτη των Θεμελιωδών Δικαιωμάτων', 'score': 10},
        {'text': 'Το Ευρωπαϊκό Κοινοβούλιο', 'score': 0},
        {'text': 'Τον Ευρωπαίο Επίτροπο', 'score': 0},
      ],
    },

//8.3
    {
      'questionText': 'Ο Χάρτης των Θεμελιωδών Δικαιωμάτων της Ευρωπαϊκής Ένωσης διακηρύχθηκε:',
      'answers': [
        {'text': 'Το 2000', 'score': 10},
        {'text': 'Το 2007', 'score': 0},
        {'text': 'Το 2004', 'score': 0},
        {'text': 'Το 1998', 'score': 0},
      ],
    },

//8.4
    {
      'questionText': 'Ο Χάρτης κατέστη νομικά δεσμευτικός στο σύνολο της ΕΕ με την έναρξη ισχύος της συνθήκης:',
      'answers': [
        {'text': 'Του Άμστερνταμ', 'score': 0},
        {'text': 'Της Νίκαιας', 'score': 0},
        {'text': 'Για τη θέσπιση Συντάγματος της Ευρώπης', 'score': 0},
        {'text': 'Της Λισαβόνας', 'score': 10},
      ],
    },

//8.5
    {
      'questionText': 'Ο σεβασμός της ανθρώπινης αξιοπρέπειας και των δικαιωμάτων του ανθρώπου, η ελευθερία, η δημοκρατία, η ισότητα και το κράτος δικαίου αποτελούν:',
      'answers': [
        {'text': 'Αξίες που εφαρμόζονται μόνο σε μερικά κράτη μέλη', 'score': 0},
        {'text': 'Κοινές αξίες της ΕΕ', 'score': 10},
        {'text': 'Ακατοχύρωτες αξίες', 'score': 0},
        {'text': 'Αξίες που παραβιάζονται', 'score': 0},
      ],
    },

//8.6
    {
      'questionText': 'Το Ευρωπαϊκό Δικαστήριο Δικαιωμάτων του Ανθρώπου εδρεύει:',
      'answers': [
        {'text': 'Στις Βρυξέλλες', 'score': 0},
        {'text': 'Στο Λουξεμβούργο', 'score': 0},
        {'text': 'Στη Φρανκφούρτη', 'score': 0},
        {'text': 'Στο Στρασβούργο', 'score': 10},
      ],
    },

//8.7
    {
      'questionText': 'Το Ευρωπαϊκό Δικαστήριο:',
      'answers': [
        {'text': 'Μεσολαβεί εκ μέρους σας ενώπιον της αρχής κατά της οποίας υποβάλλετε παράπονο', 'score': 0},
        {'text': 'Σας βοηθά στην ανεύρεση ή πληρωμή δικηγόρου για τη σύνταξη της προσφυγής', 'score': 0},
        {'text': 'Δεν λειτουργεί ως εφετείο ως προς τα εθνικά δικαστήρια', 'score': 10},
        {'text': 'Είναι αρμόδιο για την εκτέλεση των αποφάσεών του', 'score': 0},
      ],
    },

//8.8
    {
      'questionText': 'Οι πολίτες μπορούν να υποβάλουν αναφορά για να καταγγείλουν κάθε παραβίαση του κοινοτικού δικαίου:',
      'answers': [
        {'text': 'Στην Ισλαμική Διάσκεψη', 'score': 0},
        {'text': 'Στο Ευρωπαϊκό Κοινοβούλιο', 'score': 10},
        {'text': 'Στο Συμβούλιο Ασφαλείας του ΟΗΕ', 'score': 0},
        {'text': 'Στη Βασίλισσα της Αγγλίας', 'score': 0},
      ],
    },

//8.9
    {
      'questionText': 'Η θέση του Ευρωπαίου Διαμεσολαβητή δημιουργήθηκε με τη συνθήκη για την Ευρωπαϊκή Ένωση:',
      'answers': [
        {'text': 'Το 1986', 'score': 0},
        {'text': 'Το 1992', 'score': 10},
        {'text': 'Το 2004', 'score': 0},
        {'text': 'Το 2001', 'score': 0},
      ],
    },

//8.10
    {
      'questionText': 'Διαμεσολαβητής εκλέγεται από το Ευρωπαϊκό κοινοβούλιο και η θητεία του είναι:',
      'answers': [
        {'text': 'Πενταετής', 'score': 10},
        {'text': 'Δεκαετής', 'score': 0},
        {'text': 'Ετήσια', 'score': 0},
        {'text': 'Εξαμηνιαία', 'score': 0},
      ],
    },


//9.1
    {
      'questionText': 'Τις βάσεις για μια κοινή Εξωτερική Πολιτική και Πολιτική Ασφάλειας (KEΠΠA) της ΕΕ έθεσε η Συνθήκη:',
      'answers': [
        {'text': 'Της Ρώμης', 'score': 0},
        {'text': 'Ζυρίχης-Λονδίνου', 'score': 0},
        {'text': 'Της Λωζάνης', 'score': 0},
        {'text': 'Του Μάαστριχτ', 'score': 10},
      ],
    },

//9.2
    {
      'questionText': 'Ποιου σώματος χρειάζεται η συγκατάθεση για τον διορισμό του Ύπατου Εκπροσώπου της ΕΕ για θέματα Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας;',
      'answers': [
        {'text': 'Συμβουλίου της Ευρώπης', 'score': 0},
        {'text': 'Επιτροπής των Περιφερειών', 'score': 0},
        {'text': 'Ευρωκοινοβουλίου', 'score': 10},
        {'text': 'SEDE', 'score': 0},
      ],
    },

//9.3
    {
      'questionText': 'Οι πιο σημαντικοί τομείς της κοινής Εξωτερικής Πολιτικής και Πολιτικής Ασφάλειας (ΚΕΠΠΑ) είναι:',
      'answers': [
        {'text': 'Διατήρηση της ειρήνης και ενίσχυση της διεθνούς ασφάλειας', 'score': 10},
        {'text': 'Ανταγωνισμός και Αλιεία', 'score': 0},
        {'text': 'Προσωπικά δεδομένα', 'score': 0},
        {'text': 'Αθλητισμός', 'score': 0},
      ],
    },

//9.4
    {
      'questionText': 'Τι χρηματικό ποσό θα διαθέσει η Ευρωπαϊκή Επιτροπή ως αναπτυξιακή βοήθεια στις χώρες Αφρικής, καραϊβικής και Ειρηνικού τα έτη 2014-2020;',
      'answers': [
        {'text': '30,5 δις ευρώ', 'score': 10},
        {'text': '500 δις ευρώ', 'score': 0},
        {'text': '1 δις ευρώ', 'score': 0},
        {'text': '800 εκ. ευρώ', 'score': 0},
      ],
    },

//9.5
    {
      'questionText': 'Πόσο τοις εκατό της παγκόσμιας αναπτυξιακής βοήθειας χορηγεί η ΕΕ (στοιχεία 2017);',
      'answers': [
        {'text': '50%', 'score': 0},
        {'text': '60%', 'score': 10},
        {'text': '80%', 'score': 0},
        {'text': '10%', 'score': 0},
      ],
    },

//9.6
    {
      'questionText': 'Μεγαλύτερη αδυναμία της εξωτερικής πολιτικής της ΕΕ θεωρείται:',
      'answers': [
        {'text': 'Ο ενιαίος πολιτικός λόγος που εκφράζει', 'score': 0},
        {'text': 'Η έλλειψη ενιαίου πολιτικού λόγου', 'score': 10},
        {'text': 'Η έλλειψη κοινής γεωγραφίας', 'score': 0},
        {'text': 'Δεν έχει αδυναμίες', 'score': 0},
      ],
    },

//9.7
    {
      'questionText': 'Ποια συμφωνία διαμορφώνει το πλαίσιο συνεργασίας ΕΕ-ΝΑΤΟ σε θέματα ασφάλειας;',
      'answers': [
        {'text': 'Της Φρανκφούρτης', 'score': 0},
        {'text': 'Της Αθήνας', 'score': 0},
        {'text': 'Της Νίκαιας', 'score': 0},
        {'text': 'Berlin Plus', 'score': 10},
      ],
    },

//9.8
    {
      'questionText': 'Οι πρώτες στρατιωτικές αποστολές της ΕΕ πραγματοποιήθηκαν:',
      'answers': [
        {'text': 'Στην Κύπρο', 'score': 0},
        {'text': 'Σε Βαλκάνια και Κόνγκο', 'score': 10},
        {'text': 'Στην Κίνα', 'score': 0},
        {'text': 'Στη Βραζιλία', 'score': 0},
      ],
    },

//9.9
    {
      'questionText': 'Οι στρατιωτικές ομάδες μάχης της ΕΕ είναι:',
      'answers': [
        {'text': 'Γερμανικής εθνικότητας', 'score': 0},
        {'text': 'Βρετανικής εθνικότητας', 'score': 0},
        {'text': 'Γαλλικής εθνικότητας', 'score': 0},
        {'text': 'Πολυεθνικές', 'score': 10},
      ],
    },

//9.10
    {
      'questionText': 'Από ποιες χώρες εισάγει φυσικό αέριο η ΕΕ;',
      'answers': [
        {'text': 'Ρωσία, Νορβηγία, Αλγερία', 'score': 10},
        {'text': 'Ελβετία, Πακιστάν, ΗΠΑ', 'score': 0},
        {'text': 'Καζακστάν, Αίγυπτο, Ισραήλ', 'score': 0},
        {'text': 'Αργεντινή, Ελβετία, Νησιά Φαρόε', 'score': 0},
      ],
    },


//10.1
    {
      'questionText': 'Τι πληθυσμό έχει η Ευρώπη των 28 (στοιχεία 2018);',
      'answers': [
        {'text': 'Περίπου 300 εκατομμύρια', 'score': 0},
        {'text': 'Περίπου 1 δισεκατομμύριο', 'score': 0},
        {'text': 'Περίπου 500 εκατομμύρια', 'score': 10},
        {'text': 'Περίπου 800 εκατομμύρια', 'score': 0},
      ],
    },

//10.2
    {
      'questionText': 'Ποια χώρα της ΕΕ έχει τη μεγαλύτερη έκταση;',
      'answers': [
        {'text': 'Η Κροατία', 'score': 0},
        {'text': 'Η Γαλλία', 'score': 10},
        {'text': 'Η Ισπανία', 'score': 0},
        {'text': 'Η Γερμανία', 'score': 0},
      ],
    },

//10.3
    {
      'questionText': 'Σύμφωνα με το Ευρωβαρόμετρο της Άνοιξης 2019, τι ποσοστό των Ευρωπαίων πολιτών απάντησε ότι η ζωή τους θα είναι καλύτερη σε ένα χρόνο;',
      'answers': [
        {'text': '26%', 'score': 0},
        {'text': '32%', 'score': 10},
        {'text': '43%', 'score': 0},
        {'text': '49%', 'score': 0},
      ],
    },

//10.4
    {
      'questionText': 'Τι δεν ισχύει για τα χαρτονομίσματα του ευρώ;',
      'answers': [
        {'text': 'Είναι σε κάθε χώρα διαφορετικά', 'score': 10},
        {'text': 'Είναι ίδια σε όλες τις χώρες', 'score': 0},
        {'text': 'Απεικονίζουν γέφυρες που συμβολίζουν την επικοινωνία', 'score': 0},
        {'text': 'Απεικονίζουν παράθυρα και πύλες που συμβολίζουν την ευρύτητα', 'score': 0},
      ],
    },

//10.5
    {
      'questionText': 'Η Γερμανία, με πληθυσμό πάνω από 81 εκατομμύρια, τι ποσοστό του ευρωπαϊκού πληθυσμού έχει;',
      'answers': [
        {'text': 'Σχεδόν το μισό', 'score': 0},
        {'text': 'Το ένα τέταρτο', 'score': 0},
        {'text': 'Γύρω στο 16%', 'score': 10},
        {'text': 'Ένα 10%', 'score': 0},
      ],
    },

//10.6
    {
      'questionText': 'Οι τρεις μεγαλύτερες σε έκταση χώρες της ΕΕ είναι με τη σειρά:',
      'answers': [
        {'text': 'Γαλλία, Ισπανία, Γερμανία', 'score': 0},
        {'text': 'Γαλλία, Ισπανία, Ηνωμένο Βασίλειο', 'score': 0},
        {'text': 'Γαλλία, Ισπανία, Σουηδία', 'score': 10},
        {'text': 'Γαλλία, Ισπανία, Πολωνία', 'score': 0},
      ],
    },

//10.7
    {
      'questionText': 'Η Γαλλία, που είναι η μεγαλύτερη χώρα της ΕΕ των 28, τι ποσοστό του συνολικού εδάφους έχει;',
      'answers': [
        {'text': '14,8%', 'score': 10},
        {'text': '25,3%', 'score': 0},
        {'text': '8%', 'score': 0},
        {'text': '9,5%', 'score': 0},
      ],
    },

//10.8
    {
      'questionText': 'Σύμφωνα με την απογραφή του 2011, τι ποσοστό του πληθυσμού της Κύπρου είναι άνω των 65 ετών;',
      'answers': [
        {'text': '10%', 'score': 0},
        {'text': '13%', 'score': 10},
        {'text': '20%', 'score': 0},
        {'text': '22%', 'score': 0},
      ],
    },

//10.9
    {
      'questionText': 'Χώρες με πληθυσμό γύρω στα 10 εκατομμύρια είναι:',
      'answers': [
        {'text': 'Η Πορτογαλία, η Ουγγαρία, η Τσεχία και το Βέλγιο', 'score': 10},
        {'text': 'Η Μάλτα, το Λουξεμβούργο, η Λιθουανία και η Λετονία', 'score': 0},
        {'text': 'Η Πορτογαλία, η Γαλλία, το Ηνωμένο Βασίλειο και η Πολωνία', 'score': 0},
        {'text': 'Η Βουλγαρία, η Ρουμανία, η Ελλάδα και η Κύπρος', 'score': 0},
      ],
    },

//10.10
    {
      'questionText': 'Το νόμισμα της Ελλάδας πριν αντικατασταθεί από το ευρώ ήταν:',
      'answers': [
        {'text': 'Η μνα', 'score': 0},
        {'text': 'Η δραχμή', 'score': 10},
        {'text': 'Ο παράς', 'score': 0},
        {'text': 'Η ελληνική λίρα', 'score': 0},
      ],
    },


  ];


  var _qnum = 0;
  var _countnum = 1;
  var _totalScore = 0;
  int seconds = 10;
  bool isCorrect = false;

  void _answerQuestion(int score) {
    _totalScore = _totalScore + score;

    setState(() {
      _qnum = _qnum + 1;
      _countnum = _countnum + 1;
    });

//    print(_qnum);  //test

//    if (_qnum < 10) {  //test
//      print("we have more questions");
//    } else {
//      print('No more questions');
//    }
  }

  String get resultPhrase {
    String resultText;
    if (_totalScore <= 40) {
      resultText = 'You need more practice!';
    } else if (_totalScore <= 70) {
      resultText = 'Good job!';
    } else {
      resultText = 'Congratulations!!!';
    }
    return resultText;
  }


  @override
  Widget build(BuildContext context) {
    int randnum;
    randnum = Random().nextInt(100);
    SystemChrome.setPreferredOrientations(
        [DeviceOrientation.portraitDown, DeviceOrientation.portraitUp]);
    return MaterialApp(
      home: _qnum < 10
          ? Scaffold(
        appBar: AppBar(
          backgroundColor: Colors.indigoAccent[700],
          title: SafeArea(
            child: Row(
              mainAxisAlignment: MainAxisAlignment.spaceBetween,
              children: <Widget>[
                Container(
                  child: Text(
                    '$_countnum/10',
                    style: TextStyle(
                      fontSize: 28,
                    ),
                  ),
                ),
//                      Container(   //for future updates - ADD TIMER
//                        child: Text(
//                          '        $seconds',
//                          style: TextStyle(
//                            fontSize: 28,
//                          ),
//                        ),
//                      ),
                Container(
                  child: Text(
                    'Score: $_totalScore',
                    style: TextStyle(
                      fontSize: 28,
                    ),
                  ),
                ),
              ],
            ),
          ),
        ),
        body: Column(
          mainAxisAlignment: MainAxisAlignment.spaceBetween,
          children: [
            SizedBox(),
            Column(
              children: <Widget>[
                Row(
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: <Widget>[
                    new Flexible(
//                          margin: EdgeInsets.fromLTRB(0, 5, 0, 0),
                      child: Container(
                        margin: EdgeInsets.fromLTRB(10, 5, 10, 0),
                        //padding: EdgeInsets.fromLTRB(30, 0, 30, 0),
                        child: Column(
                          crossAxisAlignment: CrossAxisAlignment.center,
                          children: <Widget>[
                            new Text(
                              questions[randnum]['questionText'],
                              style: new TextStyle(
                                color: Colors.black,
                                fontSize: 28.0,
                                fontWeight: FontWeight.bold,
                              ),
                              textAlign: TextAlign.center,
                            ),
                          ],
                        ),
                      ),
                    ),
                  ],
                ),
              ],
            ),
            Column(
              crossAxisAlignment: CrossAxisAlignment.stretch,
              children: [
                ...(questions[randnum]['answers']
                as List<Map<String, Object>>)
                    .map((answer) {
                  return Answer(() => _answerQuestion(answer['score']),
                      answer['text']);
                }).toList()
              ],
            ),
          ],
        ),
      )
          : Scaffold(
        backgroundColor: Colors.indigoAccent[700],
        body: Column(
          mainAxisAlignment: MainAxisAlignment.center,
          children: <Widget>[
            Text(
              '$resultPhrase',
              style: TextStyle(
                color: Colors.white,
                fontSize: 44.0,
                fontWeight: FontWeight.bold,
              ),
              textAlign: TextAlign.center,
            ),
            Text(
              'Total score: $_totalScore/100',
              style: TextStyle(
                color: Colors.white,
                fontSize: 36.0,
                fontWeight: FontWeight.bold,
              ),
              textAlign: TextAlign.center,
            ),
            Column(
              crossAxisAlignment: CrossAxisAlignment.stretch,
              children: <Widget>[
                Container(
                  height: 100.0,
                  margin: EdgeInsets.fromLTRB(20, 30, 20, 0),
                  child: ClipRRect(
                    borderRadius: BorderRadius.circular(20.0),
                    child: RaisedButton(
                      onPressed: () {
                        Navigator.pushReplacement(
                          context,
                          MaterialPageRoute(
                              builder: (context) => questionpage()),
                        );
                      },
                      child: Text(
                        'Play Again',
                        style: new TextStyle(
                            color: Colors.black,
                            fontSize: 40.0,
                            fontWeight: FontWeight.bold),
                      ),
                      color: Colors.amberAccent,
                    ),
                  ),
                ),
              ],
            ),
            Column(
              crossAxisAlignment: CrossAxisAlignment.stretch,
              children: <Widget>[
                Container(
                  height: 100.0,
                  margin: EdgeInsets.fromLTRB(20, 20, 20, 0),
                  child: ClipRRect(
                    borderRadius: BorderRadius.circular(20.0),
                    child: RaisedButton(
                      onPressed: () {
                        Navigator.pushReplacement(
                          context,
                          MaterialPageRoute(
                              builder: (context) => startpage()),
                        );
                      },
                      child: Text(
                        'Main Menu',
                        style: new TextStyle(
                            color: Colors.black,
                            fontSize: 40.0,
                            fontWeight: FontWeight.bold),
                      ),
                      color: Colors.amberAccent,
                    ),
                  ),
                ),
              ],
            ),
          ],
        ),
      ),
    );
  }
}
